Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.CannotPlaceSystemMullionFamilyOnCurtainWall Property
 Can't place System Mullion Family on this Curtain Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceSystemMullionFamilyOnCurtainWall { get; }
Public Shared ReadOnly Property CannotPlaceSystemMullionFamilyOnCurtainWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceSystemMullionFamilyOnCurtainWall {
	FailureDefinitionId^ get ();
}
static member CannotPlaceSystemMullionFamilyOnCurtainWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace